/*
## 5.8 증가, 감소 연산자(Plus, minus Operators)
*/

#include <stdio.h>

    int main() {
    int a = 0;
    a++; // a = a + 1 or a += 1;
    printf("%d\n", a);

    ++a; // a = a + 1 or a += 1;
    printf("%d\n", a);

    return 0;
}


/*********************************************************
*********************************************************/


int main() {
    double b = 0; // 실수형에서도 1.0을 더해주는 효과
    b++;
    printf("%f\n", b);

    ++b;
    printf("%f\n", b);

    return 0;
}


/*********************************************************
*********************************************************/


//while에서 ++

int main() {
    int count = 0;
    while (count < 10) // ++count or count++
    {
    printf("%d ", count); // ++count or count++
    count ++; // ++count or count++ 현재 상태에서 기능은 같다.
    }

    return 0;
}


/*********************************************************
*********************************************************/


//※ while()안에 ++
//++count

int main() {
    int count = 0;
    while (++count < 10) // ++count or count++
    {
    printf("%d ", count); // ++count or count++
    //++count;
    }

    return 0;
}

/*
1 더하고 시작
결과 : 1~9
*/

/*********************************************************
*********************************************************/

//count++

int main() {
    int count = 0;
    while (count++ < 10) // ++count or count++
    {
    printf("%d ", count); // ++count or count++
    //++count;
    }

    return 0;
}

/*
결과 : 1~10
비교 후 ++가 적용된다(예약하는 형태)
*/


/*********************************************************
*********************************************************/

//printf 안에서 ++

int main() {
    int count = 0;
    while (count < 10) // ++count or count++
    {
    printf("%d ", ++count); // ++count or count++
    //++count;
    }

    return 0;
}

//결과 : 1~10


/*********************************************************
*********************************************************/


int main() {
    int count = 0;
    while (count < 10) // ++count or count++
    {
    printf("%d ", count++); // ++count or count++
    //++count;
    }

    return 0;
}

/*
결과 : 0~9
printf 적용하고 ++적용
*/

/*********************************************************
*********************************************************/


//*

int main() {
    int i = 1, j = 1;
    int i_post, pre_j;

    i_post = i++;
    pre_j = ++j;

    printf("%d %d\n", i, j);
    printf("%d %d\n", i_post, pre_j);

    return 0;
}


/*********************************************************
*********************************************************/


int main() {
    int i = 3;
    int l = 2 * --i;
    printf("%d %d\n", i, l);

    i = 1;
    l = 2 * i--;
    printf("%d %d\n", i, l);

    return 0;
}


/*********************************************************
*********************************************************/


int main() {
    /* very high precedence */
    int x, y, z;
    x = 3, y = 4;
    z = (x + y++) * 5; // (x+y)++ or x+(y++) ?
    printf("%d %d %d", x, y, z);

    return 0;
}


/*********************************************************
*********************************************************/


int main() {
    /* ++ and -- affect modifiable lvalues */ // literal이나 const에 사용 불가
    int x = 1, y = 1, z;
    z = x - y++; // (x) _ (y++), not (x*y)++ // (x*y)는 일시적으로 r-value이기 때문에 안됨(메모리 공간 갖지 못함, 일시적임)
    //z = (x \* y)++; //error
    //z = 3++; //error

    return 0;
}


/*********************************************************
*********************************************************/


//주의사항

int main() {
    /* Bad practices */ // n++를 너무 남발해서 복잡해 보이지 않도록 하자(명확한 경우에만 사용하자)
    int n = 1;
    printf("%d %d", n, n - n++); // 여러번 사용할 때, 시스템마다 결과가 다르게 나올 수 있다.(안전하지 않음)
    int x = n / 2 + 5 - (1 + n++); // 이 경우도 마찬가지, 이럴 때에는 식을 쪼개는 게 좋다.(의도를 명확하게 반영할 수 있도록)
    int y = n++ + n++; // 헷갈리고 의도가 무엇인지 헷갈린다.

    return 0;
}
